Функция ВсеGET(Запрос)
	Возврат OData4_Сервис.Обработать(Запрос, "odata");
КонецФункции

Функция ВсеOPTIONS(Запрос)
	Возврат OData4_Сервис.ОбработатьOPTIONS(Запрос, "odata");
КонецФункции


Функция ВсеPOST(Запрос)
	Возврат OData4_Сервис.Обработать(Запрос, "odata");
КонецФункции

Функция ВсеPUT(Запрос)
	Возврат OData4_Сервис.Обработать(Запрос, "odata");
КонецФункции

Функция ВсеPATCH(Запрос)
	Возврат OData4_Сервис.Обработать(Запрос, "odata");
КонецФункции

Функция ВсеMERGE(Запрос)
	Возврат OData4_Сервис.Обработать(Запрос, "odata");
КонецФункции

Функция ВсеDELETE(Запрос)
	Возврат OData4_Сервис.Обработать(Запрос, "odata");
КонецФункции