#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Строки = Новый Массив;
	Если ТипЗнч(Параметры.Тексты) = Тип("Массив") Или ТипЗнч(Параметры.Тексты) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Текст Из Параметры.Тексты Цикл
			Строки.Добавить("• " + Текст);
		КонецЦикла;
	КонецЕсли;
	Тексты = СтрСоединить(Строки, Символы.ПС);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОткрытьНастройки(Команда)
	ОткрытьФорму("Обработка.OData4_Настройки.Форма");
	Закрыть();
КонецПроцедуры

#КонецОбласти
